[
    {
        "title": "A systems approach to land-use planning in irrigated areas",
        "pub_year": "1997",
        "citation": "Applications of Systems Approaches at the Farm and Regional Levels Volume 1 …, 1997"
    },
    {
        "title": "Additional Reviewers MSR 2019",
        "citation": ""
    },
    {
        "title": "Agroecological transformation for sustainable food systems: Insight on France-CGIAR research",
        "pub_year": "2021",
        "citation": "Les dossiers d'Agropolis International. Special Partnership Issue, 2021"
    },
    {
        "title": "Avaliação do potencial toxigênico de fungos filamentosos isolados de uvas e solo de vinhedos do vale do submédio São Francisco.",
        "pub_year": "2019",
        "citation": "In: ENCONTRO NACIONAL DE MICOTOXINAS, 16., 2019, Belo Horizonte. Anais …, 2019"
    },
    {
        "title": "Characterizing and identifying composite refactorings: Concepts, heuristics and patterns",
        "pub_year": "2020",
        "citation": "Proceedings of the 17th International Conference on Mining Software …, 2020"
    },
    {
        "title": "Code Anomalies Flock Together",
        "citation": ""
    },
    {
        "title": "Code anomalies flock together: Exploring code anomaly agglomerations for locating design problems",
        "pub_year": "2016",
        "citation": "Proceedings of the 38th International Conference on Software Engineering …, 2016"
    },
    {
        "title": "Collaborative identification of code smells: A multi-case study",
        "pub_year": "2017",
        "citation": "2017 IEEE/ACM 39th International Conference on Software Engineering …, 2017"
    },
    {
        "title": "Dark adapted cone/rod thresholds and ERGs in Duchenne muscular dystrophy",
        "pub_year": "2020",
        "citation": "Investigative Ophthalmology & Visual Science 61 (7), 5047-5047, 2020"
    },
    {
        "title": "Does refactoring improve software structural quality? a longitudinal study of 25 projects",
        "pub_year": "2016",
        "citation": "Proceedings of the XXX Brazilian Symposium on Software Engineering, 73-82, 2016"
    },
    {
        "title": "Don’t Forget the Exception!: Considering Robustness Changes to Identify Design Problems",
        "pub_year": "2023",
        "citation": "2023 IEEE/ACM 20th International Conference on Mining Software Repositories …, 2023"
    },
    {
        "title": "Dívida Técnica: um estudo de caso com produtos de código aberto",
        "pub_year": "2013",
        "citation": ""
    },
    {
        "title": "Evoluçao de software livre baseada em métricas de qualidade: Um estudo de caso",
        "pub_year": "2013",
        "citation": "Anais do IX Simpósio Brasileiro de Sistemas de Informação, 815-826, 2013"
    },
    {
        "title": "Extensive grassland management promotes greater above-and belowground community richness in two contrasting agroclimatic regions in Switzerland",
        "citation": "Meeting the future demands for grassland production, 415, 0"
    },
    {
        "title": "FATORES SOCIAIS, AMBIENTAIS E ECONÔMICOS DA PRODUÇÃO DE BIOGÁS: O CASO DA USINA DE BIOGÁS DE ENTRE RIOS DO OESTE/PR",
        "pub_year": "2023",
        "citation": "DESENVOLVIMENTO RURAL E SUSTENTABILIDADE: ENERGIA, PRODUÇÃO E NOVOS MERCADOS …, 2023"
    },
    {
        "title": "Fruit flies (Diptera: Tephritidae) and their parasitoids associated with different hog plum genotypes in Teresina, Piauí",
        "pub_year": "2017",
        "citation": "Revista Brasileira de Fruticultura 39, e-725, 2017"
    },
    {
        "title": "Fungal diversity and occurrence of mycotoxin producing fungi in tropical vineyards.",
        "pub_year": "2021",
        "citation": "World Journal of Microbiology and Biotechnology, v. 37, n. 112, p. 1-11, May …, 2021"
    },
    {
        "title": "Fungos ocratoxigênicos em uvas viníferas Syrah cultivadas no Vale do Submédio São Francisco.",
        "pub_year": "2016",
        "citation": "In: CONGRESSO BRASILEIRO DE MICOLOGIA, 8., 2016, Florianópolis. Anais... São …, 2016"
    },
    {
        "title": "Higienistas dentales",
        "pub_year": "2006",
        "citation": "Sevilla: MAD, 2006"
    },
    {
        "title": "How Do So ware Developers Identify Design Problems?",
        "pub_year": "2017",
        "citation": ""
    },
    {
        "title": "How do software developers identify design problems? a qualitative analysis",
        "pub_year": "2017",
        "citation": "Proceedings of the XXXI Brazilian Symposium on Software Engineering, 54-63, 2017"
    },
    {
        "title": "INFLUÊNCIA DO ENRIQUECIMENTO AMBIENTAL NO COMPORTAMENTO DE JABUTIS-PIRANGA (CHELONOIDIS CARBONARIA) DO BIOPARQUE ZOOBOTÂNICO DE TERESINA-PI",
        "pub_year": "2023",
        "citation": "ZOOLOGIA: DIVULGANDO O CONHECIMENTO CIENTÍFICO 1 (1), 94-104, 2023"
    },
    {
        "title": "Identifying design problems in the source code: A grounded theory",
        "pub_year": "2018",
        "citation": "Proceedings of the 40th international conference on software engineering …, 2018"
    },
    {
        "title": "Incidência de fungos ocratoxigênicos em uvas destinadas a produção de vinhos do Nordeste brasileiro.",
        "pub_year": "2016",
        "citation": "In: CONGRESSO BRASILEIRO DE MICOLOGIA, 8., 2016, Florianópolis. Anais... São …, 2016"
    },
    {
        "title": "Moscas-das-frutas (Diptera: Tephritidae) e seus parasitoides em diferentes genótipos de Cajá em um pomar comercial de Teresina, Piauí",
        "pub_year": "2017",
        "citation": "Revista Brasileira de Fruticultura 39, e-725, 2017"
    },
    {
        "title": "No code anomaly is an island: Anomaly agglomeration as sign of product line instabilities",
        "pub_year": "2017",
        "citation": "Mastering Scale and Complexity in Software Reuse: 16th International …, 2017"
    },
    {
        "title": "On the density and diversity of degradation symptoms in refactored classes: A multi-case study",
        "pub_year": "2019",
        "citation": "2019 IEEE 30th International Symposium on Software Reliability Engineering …, 2019"
    },
    {
        "title": "On the identification of design problems in stinky code: experiences and tool support",
        "pub_year": "2018",
        "citation": "Journal of the Brazilian Computer Society 24, 1-30, 2018"
    },
    {
        "title": "On the prioritization of design-relevant smelly elements: A mixed-method, multi-project study",
        "pub_year": "2019",
        "citation": "Proceedings of the XIII Brazilian Symposium on Software Components …, 2019"
    },
    {
        "title": "Recommending composite refactorings for smell removal: Heuristics and evaluation",
        "pub_year": "2020",
        "citation": "Proceedings of the XXXIV Brazilian Symposium on Software Engineering, 72-81, 2020"
    },
    {
        "title": "Recruiting from the network: Discovering twitter users who can help combat zika epidemics",
        "pub_year": "2017",
        "citation": "Web Engineering: 17th International Conference, ICWE 2017, Rome, Italy, June …, 2017"
    },
    {
        "title": "Refactoring effect on internal quality attributes: What haven’t they told you yet?",
        "pub_year": "2020",
        "citation": "Information and Software Technology 126, 106347, 2020"
    },
    {
        "title": "Removal of design problems through refactorings: are we looking at the right symptoms?",
        "pub_year": "2019",
        "citation": "2019 IEEE/ACM 27th International Conference on Program Comprehension (ICPC …, 2019"
    },
    {
        "title": "Revealing Design Problems in Stinky Code",
        "citation": ""
    },
    {
        "title": "Revealing design problems in stinky code: a mixed-method study",
        "pub_year": "2017",
        "citation": "Proceedings of the 11th Brazilian Symposium on Software Components …, 2017"
    },
    {
        "title": "Revealing developers’ arguments on validating the incidence of code smells: A focus group experience",
        "pub_year": "2021",
        "citation": "Anais do IX Workshop de Visualização, Evolução e Manutenção de Software, 31-35, 2021"
    },
    {
        "title": "Revealing the social aspects of design decay: A retrospective study of pull requests",
        "pub_year": "2020",
        "citation": "Proceedings of the XXXIV Brazilian Symposium on Software Engineering, 364-373, 2020"
    },
    {
        "title": "Small-scale agricultural grassland management can affect soil fungal community structure as much as continental scale geographic patterns",
        "pub_year": "2021",
        "citation": "FEMS Microbiology Ecology 97 (12), fiab148, 2021"
    },
    {
        "title": "Smell Patterns as Indicators of Design Degradation",
        "pub_year": "2022",
        "citation": "Brazilian Symposium on Software Engineering (SBES 2022), 2022"
    },
    {
        "title": "Smell patterns as indicators of design degradation: Do developers agree?",
        "pub_year": "2022",
        "citation": "Proceedings of the XXXVI Brazilian Symposium on Software Engineering, 311-320, 2022"
    },
    {
        "title": "Soil bacteria respond to regional edapho-climatic conditions while soil fungi respond to management intensity in grasslands along a European transect",
        "pub_year": "2022",
        "citation": "Applied Soil Ecology 170, 104264, 2022"
    },
    {
        "title": "Soil metagenomics in grasslands and forests–A review and bibliometric analysis",
        "pub_year": "2021",
        "citation": "Applied Soil Ecology 167, 104047, 2021"
    },
    {
        "title": "Spotting design problems with smell agglomerations",
        "pub_year": "2016",
        "citation": "Proceedings of the 38th International Conference on Software Engineering …, 2016"
    },
    {
        "title": "Towards effective teams for the identification of code smells",
        "pub_year": "2017",
        "citation": "2017 IEEE/ACM 10th International Workshop on Cooperative and Human Aspects …, 2017"
    },
    {
        "title": "Towards the synthesis of architecturally-relevant code anomalies",
        "pub_year": "2014",
        "citation": "Proceedings of the 11th Workshop on Software Modularity; Maceio, Brazil, 39-52, 2014"
    },
    {
        "title": "Tracking dengue epidemics using twitter content classification and topic modelling",
        "pub_year": "2016",
        "citation": "Current Trends in Web Engineering: ICWE 2016 International Workshops, DUI …, 2016"
    },
    {
        "title": "Understanding How Developers Identify Design Problems in Practice",
        "pub_year": "2018",
        "citation": "PUC-Rio, 2018"
    },
    {
        "title": "Understanding the impact of refactoring on smells: A longitudinal study of 23 software projects",
        "pub_year": "2017",
        "citation": "Proceedings of the 2017 11th Joint Meeting on foundations of Software …, 2017"
    },
    {
        "title": "VazaDengue: An information system for preventing and combating mosquito-borne diseases with social networks",
        "pub_year": "2018",
        "citation": "Information Systems 75, 26-42, 2018"
    },
    {
        "title": "VazaZika: A software platform for surveillance and control of mosquito-borne diseases",
        "pub_year": "2019",
        "citation": "16th International Conference on Information Technology-New Generations …, 2019"
    },
    {
        "title": "Vigilância entomológica da dengue, zika e chikungunya: Uma solução baseada em redes sociais e dispositivos móveis",
        "pub_year": "2016",
        "citation": "Anais do XVI Workshop de Informática Médica, 2567-2576, 2016"
    },
    {
        "title": "When Are Smells Indicators of Architectural Refactoring Opportunities? A Study of 50 Software Projects",
        "pub_year": "2020",
        "citation": "ICPC, 2020"
    }
]