[
    {
        "title": "Bargain-Hunting Robocars Could Spell the End for Downtown Parking: Cities need to plan ahead for automated vehicles that can drop passengers in urban areas then travel long …",
        "pub_year": "2019",
        "citation": "American Scientist 107 (6), 334-338, 2019"
    },
    {
        "title": "Bounding the potential increases in vehicles miles traveled for the non-driving and elderly populations and people with travel-restrictive medical conditions in an automated …",
        "pub_year": "2015",
        "citation": "Transportation Research Board 94th Annual MeetingTransportation Research Board, 2015"
    },
    {
        "title": "COVID-19 Public Transit Precautions: Trade-offs between Risk Reduction and Costs (preprint)",
        "pub_year": "2021",
        "citation": ""
    },
    {
        "title": "COVID-19 public transit precautions: Trade-offs between risk reduction and costs",
        "pub_year": "2023",
        "citation": "Transportation Research Interdisciplinary Perspectives 18, 100762, 2023"
    },
    {
        "title": "Coalitional Fairness of Autonomous Vehicles at a T-Intersection",
        "pub_year": "2022",
        "citation": "2022 IEEE 25th International Conference on Intelligent Transportation …, 2022"
    },
    {
        "title": "Congestion and Emission Impacts of Switching from In-person to Online Grocery Delivery: A Seattle Case Study",
        "pub_year": "2022",
        "citation": "Mobility21, Carnegie Mellon University, 2022"
    },
    {
        "title": "Congestion and environmental impacts of short car trip replacement with micromobility modes",
        "pub_year": "2022",
        "citation": "Transportation Research Part D: Transport and Environment 103, 103173, 2022"
    },
    {
        "title": "Connecting Pedestrians With Disabilities to Adaptive Signal Control for Safe Intersection Crossing and Enhanced Mobility: 2019 Field Test and Evaluation",
        "pub_year": "2019",
        "citation": "United States. Department of Transportation. Intelligent Transportation …, 2019"
    },
    {
        "title": "Cost and benefit estimates of partially-automated vehicle collision avoidance technologies",
        "pub_year": "2016",
        "citation": "Accident Analysis & Prevention 95, 104-115, 2016"
    },
    {
        "title": "Economic and Behavioral Dimensions of Urban Transport Policy",
        "pub_year": "2020",
        "citation": "2020 APPAM Fall Research Conference, 2020"
    },
    {
        "title": "Environmental Impacts of Short Car Trip Replacement with Micromobility Modes",
        "pub_year": "2021",
        "citation": "Mobility21, Carnegie Mellon University, 2021"
    },
    {
        "title": "Equity Effects of Rare Events on Transportation Network Company and Transit Riders",
        "pub_year": "2023",
        "citation": "Mobility21, Carnegie Mellon University, 2023"
    },
    {
        "title": "Equity and Transportation System Implications of Shared Autonomous Vehicle Deployment",
        "pub_year": "2022",
        "citation": "Rutgers University. Center for Advanced Infrastructure and Transportation, 2022"
    },
    {
        "title": "Estimating potential increases in travel with autonomous vehicles for the non-driving, elderly and people with travel-restrictive medical conditions",
        "pub_year": "2016",
        "citation": "Transportation research part C: emerging technologies 72, 1-9, 2016"
    },
    {
        "title": "Exploring the economic, environmental, and travel implications of changes in parking choices due to driverless vehicles: An agent-based simulation approach",
        "pub_year": "2018",
        "citation": "Journal of Urban Planning and Development 144 (4), 04018043, 2018"
    },
    {
        "title": "FMVSS considerations for vehicles with automated driving systems: Volume 2",
        "pub_year": "2021",
        "citation": "United States. Department of Transportation. National Highway Traffic Safety …, 2021"
    },
    {
        "title": "Impacts of vehicle automation on workforce training and driver’s licensing",
        "pub_year": "2015",
        "citation": "Transportation Research Board 94th Annual MeetingTransportation Research Board, 2015"
    },
    {
        "title": "Improving Short-Term Travel Speed Prediction with High-Resolution Spatial and Temporal Rainfall Data",
        "pub_year": "2021",
        "citation": "Journal of Transportation Engineering, Part A: Systems 147 (3), 04021004, 2021"
    },
    {
        "title": "Incentives to Encourage the Adoption of Connected and Automated Vehicles: Lessons Learned from Hybrid-Electric Vehicle Incentive Programs",
        "pub_year": "2023",
        "citation": "Future Transportation 3 (3), 986-995, 2023"
    },
    {
        "title": "Insights into Equitable and Fair Congestion Pricing Strategies in a World of Shared Automated Vehicles",
        "pub_year": "2023",
        "citation": "Mobility21, Carnegie Mellon University, 2023"
    },
    {
        "title": "Investigating the Effects of Reserved Lanes for Commercial Truck Platooning on Congestion: Pennsylvania Turnpike Case Study",
        "pub_year": "2018",
        "citation": "Transportation Research Board 97th Annual MeetingTransportation Research Board, 2018"
    },
    {
        "title": "Net-societal and net-private benefits of some existing vehicle crash avoidance technologies",
        "pub_year": "2019",
        "citation": "Accident Analysis & Prevention 125, 207-216, 2019"
    },
    {
        "title": "Online grocery delivery: Sustainable practice, or congestion generator and environmental burden?",
        "pub_year": "2023",
        "citation": "Transportation Research Part D: Transport and Environment 119, 103722, 2023"
    },
    {
        "title": "Ridehailing Service Equity in Normal and Rare Conditions",
        "pub_year": "2022",
        "citation": "Mobility21, Carnegie Mellon University, 2022"
    },
    {
        "title": "Safety and Cost Assessment of Connected and Automated Vehicles",
        "pub_year": "2018",
        "citation": "Carnegie-Mellon University. Technologies for Safe and Efficient …, 2018"
    },
    {
        "title": "Societal Impacts of a Complete Street Project in a Mixed Urban Corridor: Case Study in Pittsburgh",
        "pub_year": "2021",
        "citation": "Journal of Infrastructure Systems 27 (2), 05021003, 2021"
    },
    {
        "title": "Socioeconomic and usage characteristics of transportation network company (TNC) riders",
        "pub_year": "2020",
        "citation": "Transportation 47, 3047-3067, 2020"
    },
    {
        "title": "TRANSPORTATION INCLUDING VMT, MODE REPLACEMENT, PARKING, AND TRAVEL BEHAVIOR by ALEJANDRO HENAO BS, University of Colorado Boulder, 2006 MS, University of Colorado Denver, 2013 …",
        "pub_year": "2018",
        "citation": "Transportation Research Part C: Emerging Technologies 105 (100), 2018"
    },
    {
        "title": "Transitioning Roadways to Accommodate Connected and Automated Vehicles: A Pennsylvania Case Study",
        "pub_year": "2017",
        "citation": "Technologies for Safe and Efficient Transportation. University …, 2017"
    },
    {
        "title": "Transitioning to a Connected and Automated Vehicle Environment: Opportunities for Improving Transportation",
        "pub_year": "2017",
        "citation": "Carnegie Mellon University, 2017"
    },
    {
        "title": "Transportation Research Interdisciplinary Perspectives",
        "citation": ""
    },
    {
        "title": "Travel impacts of a complete street project in a mixed urban corridor",
        "pub_year": "2020",
        "citation": "Mobility21, Carnegie Mellon University, 2020"
    },
    {
        "title": "What stay-at-home orders reveal about dependence on transportation network companies",
        "pub_year": "2023",
        "citation": "Transportation, 1-32, 2023"
    }
]